import { json } from '@sveltejs/kit';

let data = {
  "E_1": {
    "heading": "Выбросы парниковых газов",
    "body": "Какое-то описание..."
  },
  "E_2": {
    "heading" : "Энергопотребление и энергоэффективность",
    "body" : ""
  },
  "E_3": {
    "heading" : "Выбросы в атмосферу загрязняющих веществ ",
    "body" : ""
  },
  "E_4": {
    "heading" : "Обращение с водными ресурсами",
    "body" : ""
  },
  "E_5": {
    "heading" : "Обращение с отходами",
    "body" : ""
  },
  "E_6": {
    "heading" : "Рекультивация и биоразнообразие",
    "body" : ""
  },
  "E_7": {
    "heading" : "Цепочка поставок",
    "body" : ""
  },
  "E_8": {
    "heading" : "Аварии и штрафы",
    "body" : ""
  },
  "E_9": {
    "heading" : "Инвестиции в технологии и экологические проекты",
    "body" : ""
  },
  "E_10": {
    "heading" : "Оценка портфеля",
    "body" : ""
  },
  "S_1": {
    "heading" : "Система мотивации персонала",
    "body" : ""
  },
  "S_2": {
    "heading" : "Политика равенства",
    "body" : ""
  },
  "S_3": {
    "heading" : "Охрана труда и техника безопасности ",
    "body" : ""
  },
  "S_4": {
    "heading" : "Взаимодействие с клиентами / обществом",
    "body" : ""
  },
  "G_1": {
    "heading" : "Структура собственности и реализация акционерами (участниками) прав ",
    "body" : ""
  },
  "G_2": {
    "heading" : "Органы управления",
    "body" : ""
  },
  "G_3": {
    "heading" : "Стратегия",
    "body" : ""
  },
  "G_4": {
    "heading" : "Система вознаграждения",
    "body" : ""
  },
  "G_5": {
    "heading" : "Управление рисками",
    "body" : ""
  },
  "G_6": {
    "heading" : "Раскрытие информации",
    "body" : ""
  },
}

export function GET() {
  return json(data)
}
